---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData.CalculationType
source: html/21424871-477c-4116-6866-75e78d2ef25f.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData.CalculationType Property

The calculation type, a bitmask of FittingAndAccessoryCalculationType.

## Syntax (C#)
```csharp
public int CalculationType { get; }
```